Revit 2024 API
DisplacementElement.GetDisplacementElementId Method
 The element id of the DisplacementElement that includes the specified element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static ElementId GetDisplacementElementId(
	View view,
	ElementId id
)
Visual Basic
Public Shared Function GetDisplacementElementId ( _
	view As View, _
	id As ElementId _
) As ElementId
Visual C++
public:
static ElementId^ GetDisplacementElementId(
	View^ view,
	ElementId^ id
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view.
id
Type: Autodesk.Revit.DB.ElementId
 The element id.
Return Value
 The element id of DisplacementElement that includes the specified element id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace